# ServiceDisruption

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df1 = pd.read_csv("event_type.csv")
df2 = pd.read_csv("log_feature.csv")
df3 = pd.read_csv("resource_type.csv")
df4 = pd.read_csv("severity_type.csv")
df5 = pd.read_csv("train.csv")

In [3]:
df1.head()

     id     event_type
0  6597  event_type 11
1  8011  event_type 15
2  2597  event_type 15
3  5022  event_type 15
4  5022  event_type 11

In [4]:
df1.nunique()

id            18552
event_type       53
dtype: int64

In [5]:
df1.shape

(31170, 2)

In [6]:
df1.isnull().sum()

id            0
event_type    0
dtype: int64

In [7]:
df1 = df1.drop_duplicates(subset="id",keep="first")

In [8]:
df1.shape

(18552, 2)

In [9]:
df2.head()

     id  log_feature  volume
0  6597   feature 68       6
1  8011   feature 68       7
2  2597   feature 68       1
3  5022  feature 172       2
4  5022   feature 56       1

In [10]:
df2.log_feature.nunique()

386

In [11]:
df2.shape

(58671, 3)

In [12]:
df2.isnull().sum()

id             0
log_feature    0
volume         0
dtype: int64

In [13]:
df2 = df2.drop_duplicates(subset="id",keep="first")

In [14]:
df2.shape

(18552, 3)

In [15]:
df2.tail()

         id  log_feature  volume
58659  3761   feature 87       1
58663  8720  feature 170       4
58667  6488   feature 54       3
58668   878   feature 62       1
58669  4464  feature 209       1

In [16]:
df3.head()

     id    resource_type
0  6597  resource_type 8
1  8011  resource_type 8
2  2597  resource_type 8
3  5022  resource_type 8
4  6852  resource_type 8

In [17]:
df3.isnull().sum()

id               0
resource_type    0
dtype: int64

In [18]:
df3.shape

(21076, 2)

In [19]:
df3 = df3.drop_duplicates(subset="id",keep="first")

In [20]:
df3.shape

(18552, 2)

In [21]:
df4.head()

     id    severity_type
0  6597  severity_type 2
1  8011  severity_type 2
2  2597  severity_type 2
3  5022  severity_type 1
4  6852  severity_type 1

In [22]:
df4.isnull().sum()

id               0
severity_type    0
dtype: int64

In [23]:
df4.shape

(18552, 2)

In [24]:
df4 = df4.drop_duplicates(subset="id",keep="first")

In [25]:
df4.shape

(18552, 2)

In [26]:
df5.head()

      id      location  fault_severity
0  14121  location 118               1
1   9320   location 91               0
2  14394  location 152               1
3   8218  location 931               1
4  14804  location 120               0

In [27]:
df5.isnull().sum()

id                0
location          0
fault_severity    0
dtype: int64

In [28]:
df5.shape

(7381, 3)

In [29]:
df5 = df5.drop_duplicates(subset="id",keep="first")

In [30]:
df5.shape

(7381, 3)

In [31]:
df5 = df5.sort_values(by=['id'])
df5.head()

      id      location  fault_severity
4407   1  location 601               1
5694   5  location 460               0
279    6  location 332               1
4370   8  location 243               0
2199  13  location 418               0

In [32]:
df5.id.nunique()

7381

In [33]:
a = pd.merge(df1,df2,on="id")
a.head()

     id     event_type  log_feature  volume
0  6597  event_type 11   feature 68       6
1  8011  event_type 15   feature 68       7
2  2597  event_type 15   feature 68       1
3  5022  event_type 15  feature 172       2
4  6852  event_type 11  feature 201       2

In [34]:
a.shape, df1.shape, df2.shape

((18552, 4), (18552, 2), (18552, 3))

In [35]:
b = pd.merge(df3,df4,on="id")
b.head()

     id    resource_type    severity_type
0  6597  resource_type 8  severity_type 2
1  8011  resource_type 8  severity_type 2
2  2597  resource_type 8  severity_type 2
3  5022  resource_type 8  severity_type 1
4  6852  resource_type 8  severity_type 1

In [36]:
b.shape

(18552, 3)

In [37]:
c = pd.merge(a,b,on="id")
c.head()

     id     event_type  log_feature  volume    resource_type    severity_type
0  6597  event_type 11   feature 68       6  resource_type 8  severity_type 2
1  8011  event_type 15   feature 68       7  resource_type 8  severity_type 2
2  2597  event_type 15   feature 68       1  resource_type 8  severity_type 2
3  5022  event_type 15  feature 172       2  resource_type 8  severity_type 1
4  6852  event_type 11  feature 201       2  resource_type 8  severity_type 1

In [38]:
c.shape

(18552, 6)

In [39]:
c.isnull().sum()

id               0
event_type       0
log_feature      0
volume           0
resource_type    0
severity_type    0
dtype: int64

In [40]:
clm = c.columns
for i in clm:
    if c[i].dtype == "O":
        c[i] = c[i].str.replace(r'\D', '').astype(int)
        
    

c.head()

     id  event_type  log_feature  volume  resource_type  severity_type
0  6597          11           68       6              8              2
1  8011          15           68       7              8              2
2  2597          15           68       1              8              2
3  5022          15          172       2              8              1
4  6852          11          201       2              8              1

In [41]:
c.head()

     id  event_type  log_feature  volume  resource_type  severity_type
0  6597          11           68       6              8              2
1  8011          15           68       7              8              2
2  2597          15           68       1              8              2
3  5022          15          172       2              8              1
4  6852          11          201       2              8              1

In [42]:
df5.head()

      id      location  fault_severity
4407   1  location 601               1
5694   5  location 460               0
279    6  location 332               1
4370   8  location 243               0
2199  13  location 418               0

In [43]:
df5.shape

(7381, 3)

In [44]:
df5.head()

      id      location  fault_severity
4407   1  location 601               1
5694   5  location 460               0
279    6  location 332               1
4370   8  location 243               0
2199  13  location 418               0

In [45]:
last = pd.merge(c,df5)
last.head()

,id,event_type,log_feature,volume,resource_type,severity_type,location,fault_severity
0,8011,15,68,7,8,2,location 1,0
1,2588,15,82,9,8,1,location 1,0
2,4848,11,56,3,8,1,location 1,0
3,6914,11,68,11,8,1,location 1,0
4,5337,15,201,2,8,1,location 1,0

In [46]:
last.shape

(7381, 8)

In [47]:
last.isnull().sum()

id                0
event_type        0
log_feature       0
volume            0
resource_type     0
severity_type     0
location          0
fault_severity    0
dtype: int64

In [48]:
del last["location"]

In [49]:
last.head()

,id,event_type,log_feature,volume,resource_type,severity_type,fault_severity
0,8011,15,68,7,8,2,0
1,2588,15,82,9,8,1,0
2,4848,11,56,3,8,1,0
3,6914,11,68,11,8,1,0
4,5337,15,201,2,8,1,0

In [50]:
last.shape

(7381, 7)

In [51]:
y = last["fault_severity"]

In [52]:
del last["fault_severity"]

In [53]:
x = last

In [64]:
from sklearn.ensemble import GradientBoostingClassifier
gbr = GradientBoostingClassifier()

In [65]:
tahmin = gbr.fit(x,y).predict(c)

In [66]:
tahmin

array([0, 0, 0, ..., 0, 0, 1])